In [7]:
import seaborn as sns
import pandas as pd

In [9]:
import ssl
ssl._create_default_https_context = ssl._create_unverified_context

In [10]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv"
df = pd.read_csv(url)
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# checking for missing vlaues
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [13]:
# Filling misisng value 
# Mean Imputation 

df['age'].fillna(df['age'].mean(), inplace=True)
df['age'].isnull().sum()

/var/folders/9s/fmjy0dp925l_hxlfzl_g_jjm0000gn/T/ipykernel_3706/1259306293.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].mean(), inplace=True)

np.int64(0)

In [17]:
# FIlling using Median Imputation
df = pd.read_csv(url)
df['age'] = df['age'].fillna(df['age'].median())
df['age'].isnull().sum()
df['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [26]:
# Filling using mode imputation
# Mode is used generally for categorical variables
df['embarked'] = df['embarked'].fillna(df['embarked'].mode()[0])
df['embarked'].isnull().sum()

np.int64(0)

'S'